Assignment2/disk-sysbench_results.txt
sysbench 1.0.20 (using system LuaJIT 2.1.1703358377) Running the test with following options: Number of threads: 4 Initializing random number generator from current time Extra file open flags: (none) 128 files, 48MiB each 6GiB total file size Block size 4KiB Number of IO requests: 0 Read/Write ratio for combined random IO test: 1.50 Periodic FSYNC enabled, calling fsync() each 100 requests. Calling fsync() at the end of test, Enabled. Using synchronous I/O mode Doing random read test Initializing worker threads... Threads started! File operations: reads/s: 44854.07 writes/s: 0.00 fsyncs/s: 0.00 Throughput: read, MiB/s: 175.21 written, MiB/s: 0.00 General statistics: total time: 10.0001s total number of events: 448562 Latency (ms): min: 0.00 avg: 0.09 max: 22.82 95th percentile: 0.00 sum: 39948.50 Threads fairness: events (avg/stddev): 112140.5000/184.33 execution time (avg/stddev): 9.9871/0.00
sysbench 1.0.20 (using system LuaJIT 2.1.1703358377) Running the test with following options: Number of threads: 16 Initializing random number generator from current time Extra file open flags: (none) 128 files, 48MiB each 6GiB total file size Block size 4KiB Number of IO requests: 0 Read/Write ratio for combined random IO test: 1.50 Periodic FSYNC enabled, calling fsync() each 100 requests. Calling fsync() at the end of test, Enabled. Using synchronous I/O mode Doing random read test Initializing worker threads... Threads started! File operations: reads/s: 118901.53 writes/s: 0.00 fsyncs/s: 0.00 Throughput: read, MiB/s: 464.46 written, MiB/s: 0.00 General statistics: total time: 10.0002s total number of events: 1189073 Latency (ms): min: 0.00 avg: 0.13 max: 31.74 95th percentile: 0.00 sum: 159841.99 Threads fairness: events (avg/stddev): 74317.0625/176.98 execution time (avg/stddev): 9.9901/0.00
sysbench 1.0.20 (using system LuaJIT 2.1.1703358377) Running the test with following options: Number of threads: 32 Initializing random number generator from current time Extra file open flags: (none) 128 files, 48MiB each 6GiB total file size Block size 4KiB Number of IO requests: 0 Read/Write ratio for combined random IO test: 1.50 Periodic FSYNC enabled, calling fsync() each 100 requests. Calling fsync() at the end of test, Enabled. Using synchronous I/O mode Doing random read test Initializing worker threads... Threads started! File operations: reads/s: 131662.00 writes/s: 0.00 fsyncs/s: 0.00 Throughput: read, MiB/s: 514.30 written, MiB/s: 0.00 General statistics: total time: 10.0003s total number of events: 1316704 Latency (ms): min: 0.00 avg: 0.24 max: 31.16 95th percentile: 0.00 sum: 319805.90 Threads fairness: events (avg/stddev): 41147.0000/114.07 execution time (avg/stddev): 9.9939/0.00